// @strict-types
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Активное окно

	ОкноПриложения = АктивноеОкно();

	Если ОкноПриложения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Исследуемый объект

	ИсследуемыйОбъект = Неопределено; // Произвольный - любой тип объекта
	ИсследуемыйОбъект = ИсследуемыйОбъект(ОкноПриложения);

	Если ИсследуемыйОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Форма менеджера ИР

	ПараметрыФормы = Новый Структура("ИсследуемыйОбъект", ИсследуемыйОбъект);
	ОткрытьФорму("ОбщаяФорма.PEN011_ФормаМенеджера", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Ссылка на Исследуемый объект активного окна.
// 
// Параметры:
//  ОкноПриложения - ОкноКлиентскогоПриложения, Неопределено - Окно приложения, в котором открыт исследуемый объект
// 
// Возвращаемое значение:
//  Неопределено, Произвольный - Ссылка на Исследуемый объект активного окна
&НаКлиенте
Функция ИсследуемыйОбъект(ОкноПриложения)

	ИсследуемыйОбъект = Неопределено;

	Форма = ОкноПриложения.Содержимое[0]; // ФормаКлиентскогоПриложения - 

	Если ТипЗнч(Форма.ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
		ИсследуемыйОбъект = ОбъектИзФормыСписка(Форма);
	Иначе
		//ИсследуемыйОбъект = ОбъектИзФормыОбъекта(Форма);
		ИсследуемыйОбъект = ОкноПриложения.ПолучитьНавигационнуюСсылку();
	КонецЕсли;

	Возврат ИсследуемыйОбъект;
КонецФункции

&НаКлиенте
Функция ОбъектИзФормыОбъекта(Форма)

	ИсследуемыйОбъект = Неопределено;
	
	ИсследуемыйОбъект = Форма;
	Если Истина Тогда
		
	КонецЕсли;

	Возврат ИсследуемыйОбъект;
КонецФункции

&НаКлиенте
Функция ОбъектИзФормыСписка(Форма)

	ИсследуемыйОбъект = Форма.ТекущийЭлемент.ТекущаяСтрока;

	Если Не ЗначениеЗаполнено(ИсследуемыйОбъект) Тогда
		ИсследуемыйОбъект = Неопределено;
	КонецЕсли;

	Возврат ИсследуемыйОбъект;
КонецФункции

#КонецОбласти