// @strict-types
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Активное окно

	ОкноПриложения = АктивноеОкно();

	Если ОкноПриложения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Исследуемый объект

	ИсследуемыйОбъект = Неопределено; // Произвольный - любой тип объекта
	ИсследуемыйОбъект = ИсследуемыйОбъект(ОкноПриложения);
	
	// Форма менеджера ИР

	ПараметрыФормы = Новый Структура("ИсследуемыйОбъект", ИсследуемыйОбъект);
	ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Ссылка на Исследуемый объект активного окна.
// 
// Параметры:
//  ОкноПриложения - ОкноКлиентскогоПриложения, Неопределено - Окно приложения, в котором открыт исследуемый объект
// 
// Возвращаемое значение:
//  Неопределено, Произвольный - Ссылка на Исследуемый объект активного окна
&НаКлиенте
Функция ИсследуемыйОбъект(ОкноПриложения)

	ИсследуемыйОбъект = Неопределено;

	Возврат ИсследуемыйОбъект;
КонецФункции

#КонецОбласти