// @strict-types


//************************************************************
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ПравоДоступа("Администрирование", Метаданные) Тогда
		ИсследуемыйОбъект = Параметры.ИсследуемыйОбъект;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ОформитьГруппуНавигация();

КонецПроцедуры

#КонецОбласти


//************************************************************
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияИсследоватьОбъектНажатие(Элемент)

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("мОбъектСсылка", ИсследуемыйОбъект);
	ОткрытьФорму("Обработка.PEN011_РедакторОбъекта.Форма.ФормаОбъекта", ПараметрыФормы);

	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКонсольЗапросовНажатие(Элемент)

	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Обработка.PEN011_КонсольЗапросов9000.Форма.Форма", ПараметрыФормы);

	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКонсольКодаНажатие(Элемент)

	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Обработка.PEN011_КонсольКода.Форма.Форма", ПараметрыФормы);

	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияДинамическийСписокНажатие(Элемент)

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ПолноеИмя", ПолноеИмяОбъекта());
	ОткрытьФорму("Обработка.PEN011_РедакторОбъекта.Форма.ФормаСпискаОбъектов", ПараметрыФормы);

	Закрыть();
КонецПроцедуры

#КонецОбласти


//************************************************************
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда1(Команда)

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("мОбъектСсылка", ИсследуемыйОбъект);

	ОткрытьФорму("Обработка.PEN011_РедакторОбъекта.Форма.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти


//************************************************************
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОформитьГруппуНавигация()

	Если ИсследуемыйОбъект = Неопределено Тогда
		Элементы.ДекорацияИсследоватьОбъект.Видимость = Ложь;
		Элементы.ДекорацияДинамическийСписок.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолноеИмяОбъекта()

	ПолноеИмя = "";
	
	Если ИсследуемыйОбъект = Неопределено Тогда
		Возврат ПолноеИмя;
	КонецЕсли;
	
	ПолноеИмя = ИсследуемыйОбъект.Метаданные().ПолноеИмя();
	
	Возврат ПолноеИмя;
КонецФункции

#КонецОбласти