// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если РольДоступна("ПолныеПрава") Тогда
		ИсследуемыйОбъект = Параметры.ИсследуемыйОбъект;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияИсследоватьОбъектНажатие(Элемент)

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("мОбъектСсылка", ИсследуемыйОбъект);
	ОткрытьФорму("Обработка.PEN011_РедакторОбъекта.Форма.ФормаОбъекта", ПараметрыФормы);
	
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда1(Команда)

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("мОбъектСсылка", ИсследуемыйОбъект);
	
	ОткрытьФорму("Обработка.PEN011_РедакторОбъекта.Форма.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти