// @strict-types
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИсследуемыйОбъект = Параметры.ИсследуемыйОбъект;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда1(Команда)

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("мОбъектСсылка", ИсследуемыйОбъект);
	
	ОткрытьФорму("Обработка.СДРОбъектУпр.Форма.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти