// @strict-types


//************************************************************
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ПравоДоступа("Администрирование", Метаданные) Тогда
		ИсследуемыйОбъект = Параметры.ИсследуемыйОбъект;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ОформитьГруппуНавигация();
	ЗаголовокФормы();

КонецПроцедуры

#КонецОбласти


//************************************************************
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияИсследоватьОбъектНажатие(Элемент)

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("мОбъектСсылка", ИсследуемыйОбъект);
	УИД = Новый УникальныйИдентификатор();
	ОткрытьФорму("Обработка.PEN011_РедакторОбъекта.Форма.ФормаОбъекта", ПараметрыФормы, , УИД);

	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДинамическийСписокНажатие(Элемент)

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ПолноеИмя", ПолноеИмяОбъекта());
	УИД = Новый УникальныйИдентификатор();
	ОткрытьФорму("Обработка.PEN011_РедакторОбъекта.Форма.ФормаСпискаОбъектов", ПараметрыФормы, , УИД);

	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНавигаторНажатие(Элемент)

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ПолноеИмя", ПолноеИмяОбъекта());
	УИД = Новый УникальныйИдентификатор();
	ОткрытьФорму("Обработка.PEN011_Навигатор.Форма.Форма", ПараметрыФормы, , УИД);

	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКонсольЗапросовНажатие(Элемент)

	ПараметрыФормы = Новый Структура();
	УИД = Новый УникальныйИдентификатор();
	ОткрытьФорму("Обработка.PEN011_КонсольЗапросов9000.Форма.Форма", ПараметрыФормы, , УИД);

	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКонсольЗапросов1Нажатие(Элемент)

	ПараметрыФормы = Новый Структура();
	УИД = Новый УникальныйИдентификатор();
	ОткрытьФорму("Обработка.PEN011_КонсольЗапросов_УИ.Форма.Форма", ПараметрыФормы, , УИД);

	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКонсольКодаНажатие(Элемент)

	ПараметрыФормы = Новый Структура();
	УИД = Новый УникальныйИдентификатор();
	ОткрытьФорму("Обработка.PEN011_КонсольКода.Форма.Форма", ПараметрыФормы, , УИД);

	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКонсольЗаданийНажатие(Элемент)

	ПараметрыФормы = Новый Структура();
	УИД = Новый УникальныйИдентификатор();
	ОткрытьФорму("Обработка.PEN011_КонсольЗаданий2019.Форма.Форма", ПараметрыФормы, , УИД);

	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВсеФункцииНажатие(Элемент)

	ПараметрыФормы = Новый Структура();
	УИД = Новый УникальныйИдентификатор();
	ОткрытьФорму("Обработка.PEN011_ВсеФункцииПлюс.Форма.Форма", ПараметрыФормы, , УИД);

	Закрыть();
КонецПроцедуры

#КонецОбласти


//************************************************************
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОформитьГруппуНавигация()

	Если ИсследуемыйОбъект = Неопределено Тогда
		Элементы.ДекорацияИсследоватьОбъект.Видимость = Ложь;
		Элементы.ДекорацияДинамическийСписок.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолноеИмяОбъекта()

	ПолноеИмя = "";

	Если ИсследуемыйОбъект = Неопределено Тогда
		Возврат ПолноеИмя;
	КонецЕсли;

	ПолноеИмя = ИсследуемыйОбъект.Метаданные().ПолноеИмя();

	Возврат ПолноеИмя;
КонецФункции

&НаСервере
Процедура ЗаголовокФормы()

	Отбор = Новый Структура("Имя", "PEN011_AltZ");
	Расширения = РасширенияКонфигурации.Получить(Отбор);
	Если Расширения.Количество() > 0 Тогда
		Заголовок = Расширения.Получить(0).Синоним;
	Иначе
		Заголовок = "";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти